In [1]:
import pandas as pd

In [2]:
emp = pd.read_csv('employees.csv')

In [3]:
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [7]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login Time    1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus %            1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [29]:
emp['Gender'] = emp['Gender'].astype('category')

In [30]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 933 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             795 non-null    category
 2   Start Date         933 non-null    datetime64[ns]
 3   Last Login Time    933 non-null    datetime64[ns]
 4   Salary             933 non-null    int32
 5   Bonus %            933 non-null    float64
 6   Senior Management  933 non-null    bool
 7   Team               899 non-null    category
dtypes: bool(1), category(2), datetime64[ns](2), float64(1), int32(1), object(1)
memory usage: 43.3+ KB

In [16]:
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-08-28 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-08-28 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-08-28 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-08-28 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-08-28 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2020-08-28 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2020-08-28 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-08-28 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-08-28 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-08-28 18:24:00,129949,10.169,True,Sales

In [21]:
emp.dropna(inplace=True,subset=["First Name"])

In [22]:
emp

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-08-28 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-08-28 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-08-28 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-08-28 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-08-28 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2020-08-28 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2020-08-28 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-08-28 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-08-28 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-08-28 18:24:00,129949,10.169,True,Sales

In [23]:
emp.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 933 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             795 non-null    object
 2   Start Date         933 non-null    datetime64[ns]
 3   Last Login Time    933 non-null    datetime64[ns]
 4   Salary             933 non-null    int32
 5   Bonus %            933 non-null    float64
 6   Senior Management  933 non-null    object
 7   Team               899 non-null    category
dtypes: category(1), datetime64[ns](2), float64(1), int32(1), object(3)
memory usage: 56.0+ KB

In [31]:
emp[emp['First Name'] == None]

Empty DataFrame
Columns: [First Name, Gender, Start Date, Last Login Time, Salary, Bonus %, Senior Management, Team]
Index: []

## Apart from here we are going to start with the analysis

In [32]:
emp.head()

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-08-28 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-08-28 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-08-28 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-08-28 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-08-28 16:47:00,101004,1.389,True,Client Services

In [58]:
emp[(emp['Gender'] == 'Male') 
    
    &
    
    (emp['Team'] == 'Finance')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
3,Jerry,Male,2005-03-04,2020-08-28 13:00:00,138705,9.340,True,Finance
46,Bruce,Male,2009-11-28,2020-08-28 22:47:00,114796,6.796,False,Finance
56,Carl,Male,2006-05-03,2020-08-28 17:55:00,130276,16.084,True,Finance
68,Jose,Male,2004-10-30,2020-08-28 13:39:00,84834,14.330,True,Finance
83,Shawn,Male,2005-09-23,2020-08-28 02:55:00,148115,6.539,True,Finance
117,Steven,Male,1995-03-01,2020-08-28 15:03:00,109095,9.494,False,Finance
200,Gary,Male,1987-08-12,2020-08-28 00:04:00,89661,8.525,False,Finance
205,Brandon,Male,2006-03-27,2020-08-28 17:54:00,115711,8.012,True,Finance
219,Billy,Male,1995-03-13,2020-08-28 12:05:00,120444,7.768,True,Finance
222,Jason,Male,1999-10-17,2020-08-28 22:09:00,78417,3.067,False,Finance
241,Walter,Male,1983-07-06,2020-08-28 23:54:00,127813,5.961,False,Finance
286,Todd,Male,1984-02-02,2020-08-28 10:13:00,69989,10.985,True,Finance
304,Jeremy,Male,1981-08-12,2020-08-28 00:05:00,46930,18.702,True,Finance
318,Roy,Male,2006-08-06,2020-08-28 07:52:00,148225,1.841,False,Finance
328,Samuel,Male,1991-12-19,2020-08-28 02:54:00,76076,5.319,True,Finance
335,Robert,Male,2014-11-18,2020-08-28 05:00:00,85799,19.930,False,Finance
341,Carlos,Male,2007-09-19,2020-08-28 01:01:00,77327,11.580,True,Finance
348,Philip,Male,1989-08-02,2020-08-28 11:21:00,129968,19.897,False,Finance
420,Justin,Male,1986-05-22,2020-08-28 06:30:00,121508,19.334,True,Finance
428,Christopher,Male,1999-05-13,2020-08-28 10:48:00,68028,7.869,True,Finance
458,Albert,Male,2007-09-30,2020-08-28 17:34:00,102626,15.843,False,Finance
493,Craig,Male,2005-11-01,2020-08-28 23:31:00,44857,13.266,False,Finance
582,Harry,Male,1982-11-19,2020-08-28 11:25:00,59277,10.200,False,Finance
618,Peter,Male,1992-11-24,2020-08-28 17:43:00,69297,1.268,False,Finance
620,Ralph,Male,2012-03-07,2020-08-28 02:25:00,81215,8.400,False,Finance
710,Edward,Male,1997-11-27,2020-08-28 01:00:00,58327,17.095,True,Finance
725,Jeremy,Male,1991-05-19,2020-08-28 13:40:00,131513,1.876,True,Finance
732,Henry,Male,1986-05-12,2020-08-28 02:04:00,59943,1.432,False,Finance
790,Fred,Male,1989-03-03,2020-08-28 02:27:00,129712,11.058,False,Finance
809,George,Male,1995-09-27,2020-08-28 17:04:00,36749,19.754,False,Finance
831,Kenneth,Male,2015-01-15,2020-08-28 14:41:00,69112,7.588,True,Finance
837,Joseph,Male,1985-05-23,2020-08-28 22:16:00,139570,15.804,True,Finance
854,Harry,Male,1985-02-10,2020-08-28 19:46:00,63046,10.411,False,Finance
861,Jerry,Male,1989-03-26,2020-08-28 04:15:00,140850,18.855,False,Finance
891,Timothy,Male,1991-08-25,2020-08-28 10:37:00,92587,8.475,False,Finance
954,Joe,Male,1980-01-19,2020-08-28 16:06:00,119667,1.148,True,Finance
992,Anthony,Male,2011-10-16,2020-08-28 08:35:00,112769,11.625,True,Finance
996,Phillip,Male,1984-01-31,2020-08-28 06:30:00,42392,19.675,False,Finance

In [52]:
emp[emp['Senior Management']]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-08-28 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-08-28 06:53:00,61933,4.170,True,NaN
3,Jerry,Male,2005-03-04,2020-08-28 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-08-28 16:47:00,101004,1.389,True,Client Services
6,Ruby,Female,1987-08-17,2020-08-28 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
991,Rose,Female,2002-08-25,2020-08-28 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2020-08-28 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2020-08-28 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2020-08-28 17:47:00,98874,4.479,True,Marketing
999,Albert,Male,2012-05-15,2020-08-28 18:24:00,129949,10.169,True,Sales

In [53]:
emp[emp['Team'] != 'Marketing']

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2020-08-28 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-08-28 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-08-28 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2020-08-28 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2020-08-28 16:20:00,65476,10.012,True,Product
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2020-08-28 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2020-08-28 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-08-28 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-08-28 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-08-28 18:24:00,129949,10.169,True,Sales

In [54]:
emp[emp.index == 4]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
4,Larry,Male,1998-01-24,2020-08-28 16:47:00,101004,1.389,True,Client Services

In [55]:
emp['Last Login Time'] - emp['Start Date']

0      9884 days 12:42:00
1      8916 days 06:53:00
2      9989 days 11:17:00
3      5656 days 13:00:00
4      8252 days 16:47:00
              ...
995    2105 days 06:09:00
996   13359 days 06:30:00
997    2657 days 12:39:00
998    2687 days 16:45:00
999    3027 days 18:24:00
Length: 933, dtype: timedelta64[ns]

In [60]:

emp[(emp['Gender'] == 'Male') & (emp['Team'] == 'Marketing')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-08-28 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2020-08-28 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2020-08-28 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2020-08-28 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2020-08-28 20:13:00,107391,1.260,True,Marketing
101,Aaron,Male,2012-02-17,2020-08-28 10:20:00,61602,11.849,True,Marketing
104,John,Male,1989-12-23,2020-08-28 07:01:00,80740,19.305,False,Marketing
112,Willie,Male,2003-11-27,2020-08-28 06:21:00,64363,4.023,False,Marketing
119,Paul,Male,2008-06-03,2020-08-28 15:05:00,41054,12.299,False,Marketing
150,Sean,Male,1996-05-04,2020-08-28 20:59:00,135490,19.934,False,Marketing
187,Roger,Male,2004-11-19,2020-08-28 15:55:00,51430,6.460,False,Marketing
204,Willie,Male,2006-06-06,2020-08-28 09:45:00,55281,4.935,True,Marketing
216,Matthew,Male,2013-07-31,2020-08-28 08:04:00,142373,2.462,False,Marketing
252,Ralph,Male,2004-11-11,2020-08-28 01:35:00,71896,4.232,True,Marketing
274,Howard,Male,1982-10-05,2020-08-28 07:22:00,97490,5.460,True,Marketing
293,Jesse,Male,1999-10-25,2020-08-28 15:35:00,118733,9.653,False,Marketing
309,Benjamin,Male,1984-09-11,2020-08-28 06:37:00,84810,15.794,False,Marketing
327,Aaron,Male,1994-01-29,2020-08-28 18:48:00,58755,5.097,True,Marketing
403,Craig,Male,1984-02-08,2020-08-28 04:45:00,113506,19.642,False,Marketing
413,Johnny,Male,1992-09-14,2020-08-28 08:21:00,115194,5.861,True,Marketing
452,Scott,Male,2012-11-17,2020-08-28 14:47:00,146812,1.965,True,Marketing
461,Jeremy,Male,2001-08-09,2020-08-28 03:56:00,43354,13.946,False,Marketing
464,Lawrence,Male,2005-05-13,2020-08-28 01:25:00,74640,18.641,False,Marketing
484,Joe,Male,2000-04-14,2020-08-28 15:14:00,50645,11.119,False,Marketing
496,Johnny,Male,2016-02-26,2020-08-28 19:39:00,76394,5.437,True,Marketing
503,Roger,Male,2015-08-03,2020-08-28 16:56:00,125033,4.887,True,Marketing
544,Roger,Male,2010-07-03,2020-08-28 17:11:00,105689,13.320,True,Marketing
550,Gregory,Male,1984-06-18,2020-08-28 03:46:00,82726,16.304,True,Marketing
556,Arthur,Male,2014-12-16,2020-08-28 16:56:00,66819,6.639,True,Marketing
571,Jonathan,Male,1995-04-06,2020-08-28 22:38:00,56993,18.623,False,Marketing
581,Ernest,Male,1990-01-28,2020-08-28 00:08:00,81919,15.118,False,Marketing
696,Samuel,Male,2012-05-25,2020-08-28 16:40:00,85550,11.593,True,Marketing
722,Joshua,Male,1997-06-27,2020-08-28 15:23:00,95003,5.197,True,Marketing
798,Lawrence,Male,1984-10-01,2020-08-28 14:06:00,102589,17.952,True,Marketing
860,Phillip,Male,1984-10-07,2020-08-28 11:05:00,36837,14.660,False,Marketing
867,Earl,Male,2013-06-15,2020-08-28 03:00:00,48046,7.737,False,Marketing
899,Walter,Male,1992-05-21,2020-08-28 00:39:00,144701,16.323,True,Marketing
994,George,Male,2013-06-21,2020-08-28 17:47:00,98874,4.479,True,Marketing

In [64]:
emp.iloc[1][2]

Timestamp('1996-03-31 00:00:00')

In [69]:
emp[(emp['Senior Management']  == False) | (emp['Start Date'] <= '1990-01-01')]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2020-08-28 11:17:00,130590,11.858,False,Finance
5,Dennis,Male,1987-04-18,2020-08-28 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2020-08-28 16:20:00,65476,10.012,True,Product
10,Louise,Female,1980-08-12,2020-08-28 09:01:00,63241,15.132,True,NaN
12,Brandon,Male,1980-12-01,2020-08-28 01:08:00,112807,17.492,True,Human Resources
...,...,...,...,...,...,...,...,...
990,Robin,Female,1987-07-24,2020-08-28 13:35:00,100765,10.982,True,Client Services
995,Henry,NaN,2014-11-23,2020-08-28 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2020-08-28 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-08-28 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-08-28 16:45:00,60500,11.985,False,Business Development

In [68]:
emp.loc[0]

First Name                       Douglas
Gender                              Male
Start Date           1993-08-06 00:00:00
Last Login Time      2020-08-28 12:42:00
Salary                             97308
Bonus %                            6.945
Senior Management                   True
Team                           Marketing
Name: 0, dtype: object